{
  "Michael_Scott": "His role models are Bob Hope, Abraham Lincoln, Bono, and God. Michael lost his virginity when he was 28. His signature saying is \"That's what she said\". Michael is almost incapable of keeping a secret. His deepest fear is being alone.",
  "Jim_Halpert": "Jim has appeared in every single episode of The Office with the exception of \"Mafia,\" in which only his voice can be heard.",
  "Pam_Beesley": "Pam wears a pink cardigan in episodes where it is suggested that she recently had sex. See Pam's lucky pink cardigan. Jenna Fischer and Angela Kinsey are good friends in real life. Pam and Dwight form a brief friendship while Dwight is suffering from a concussion.",
  "Dwight_Schrute": "In the episode \"Valentine's Day\", Dwight is given a bobblehead doll as a Valentine's gift, from Angela. Following the episode, fans of the show petitioned NBC to make the bobblehead doll available for purchase on their online store. NBC responded by creating an initial run of 4,000 bobblehead dolls, which sold out almost immediately.",
  "Angela_Martin": "Kinsey was pregnant during the filming of season 4, noticeably so from the episodes Dinner Party through Goodbye, Toby. The producers decided not to incorporate her pregnancy into the story line and shot around it.",
  "Kevin_Malone": "During the time period between the second and third seasons, NBC posted The Accountants, a season of \"webisodes\" with Kevin, Oscar, and Angela attempting to solve an accounting error. The error ends up being the fault of Angela and when it is discovered, Kevin says it is the best day of his life.",
  "Jan_Levinson": "In the pilot, the character of Jan was a single-episode guest, with the possibility of becoming a recurring character. During filming of that episode, Melora Hardin, Steve Carell and Greg Daniels laughed at the weird dynamic between Jan and Michael and if the show made it to a second season, \"we should have them hook up\".",
  "Darryl_Philbin": "As a subtle prank and possible retort to Michael's antics, Darryl teaches Michael \"black man phrases\", such as \"fleece it out\", \"goin' mach five\", \"bippity boppity, gimme the zoppity\", and \"dinkin' flicka.\" In addition, Darryl teaches Michael a handshake that Michael believes to be \"ghetto\".",
  "Oscar_Martinez": "Oscar inserts himself into a lot of conversations to add facts or correct grammar, he tends to use \"actually\" a lot when doing so. In a deleted scene from \"Gay Witch Hunt\", Oscar points out that he mentioned that he was gay during his job interview, but Michael thought it was a joke.",
  "Kelly_Kapoor": "Kelly has decided to call herself the business bitch, the diet bitch, the shopping bitch, and the etiquette bitch because it is important to brand yourself.",
  "Ryan_Howard": "B. J. Novak is one of the show's writing directors and executive producers. During this time, his role is significantly expanded to that of a main character.",
  "Stanley_Hudson": "Stanley begins to explain something in great detail to get people's attention, and it ends with, “...and shove it up your butt!”",
  "Creed_Bratton": "In a deleted scene from \"The Convict\", Creed states that he has been incarcerated before and that prison is where he obtained the name \"Creed\", though he later changes his story, implying that he had previously killed a man named Creed Bratton and assumed his identity.",
  "Meredith_Palmer": "Kate Flannery describes Meredith's fashion sense as \"a messed up kindergarten teacher.\" The running joke of Meredith being caught topless bothered her father so much, he wrote her a letter that read, \"Dear Kate, stop taking your clothes off. Love Dad.",
  "Phyllis_Vance": "Phyllis invited Michael to her wedding because it was the only way she could get six weeks off for her honeymoon.",
  "Todd_Packer": "Fed up with Packer's presence in the office, Jim and Dwight prank Packer into leaving Dunder Mifflin and transferring to Sabre's corporate headquarters in Tallahassee, letting him quit to head out to the nonexistent job offer.",
  "Roy_Anderson": "In \"The Negotiation\", Roy revealed that the only reason he tolerated Pam's friendship with Jim was because he thought that Jim was gay.",
  "Toby_Flenderson": "When Michael gives his two weeks notice, Toby shows he is not as resentful towards Michael as Michael is to him in a talking head, referring to him as \"a movie on an airplane, which is nothing special but something to watch\".",
  "David_Wallace": "It is known he has a daughter which was referenced in \"Secret Santa\" who is in elementary school. Michael reveals he will pretend to be her to reach David in an emergency.",
  "Robert_California": "Spader's acting had been particularly lauded by his fellow Office cast members. In an interview with Huffington Post, Brian Baumgartner stated that \"He has these demented arguments that on the surface make no sense, but he's talking, and suddenly and you're like, Oh yeah, that's right! That's right!\".",
  "Holly_Flax": "Holly was introduced to be the first person who actually liked Michael, allowing his character to mature. She was not intended to be his life partner, and was planned to be in only six episodes.",
  "Andy_Bernard": "Andy's trademark \"Rid-dit-dit-di-doo\" was something that some of Ed Helms's middle school classmates used. It was an expression of triumph after getting off a good zinger.",
  "Gabe_Lewis": "Gabe is the tallest character in the office coming at an inch taller than Jim. In the episode \"Gettysburg\" Zach Woods' act on Abraham Lincoln is fully improvised.",
  "Karen_Filippelli": "Karen dates Jim Halpert throughout the third season. Outside of the Office universe, Rashida Jones and John Krasinski dated for a brief period of time."
}